[{"title":"Hello World","content":"<p>](<a href=\"https://hexo.io/docs/one-command-deployment.html\">https://hexo.io/docs/one-command-deployment.html</a>)</p>\n<blockquote>\n<p><a href=\"https://blog.csdn.net/qq_40296909/article/details/134285451\">git 443解决办法</a> vpn下设置代理端口然后刷新dns,未挂vpn则尝试清除代理</p>\n</blockquote>\n","isPage":false,"isDraft":false,"permalink":"http://example.com/2026/01/11/hello-world/"},{"title":"外文原文小说词句整理","content":"<blockquote>\n<p>The secret of happiness is to see all the marvels of the world, and never to forget the drops of oil on the spoon.</p>\n</blockquote>\n<p>亚历山大（牧羊人）终于启程了，日出时分，他到达了非洲的一个小镇，怀着满心的期待进入了一家酒吧。他向老板要了点喝的，但是这时他才发现这儿的人说的话他听不懂，他们说的是西班牙语。</p>\n<p>但是这对亚历山大来说，特别是即将前往金字塔获得自己宝藏的他来说，这些都是小问题，毕竟离目的地越来越近了，他想。</p>\n<p>虽然老板给他递来了一杯茶水，但是他想要一杯酒，由不知道怎么说，也便作罢了。</p>\n<p>这时，酒吧进来了一个很 spain 的人，亚历山大看得出来他是’同乡’。</p>\n<p>不出所料，这个‘同乡’确实和亚历山大来自同一个国家，这使得亚历山大顿时生出一股亲切感。</p>\n<p>他喝着’酒’，在这陌生的酒吧畅谈了自己的目标，’去往埃及金字塔’。周围人听到’金字塔’这个词都不禁发出一阵嗤笑，说着他听不懂的语言，但是他能知道他们是在嘲讽他，认为他小小年纪口袋里能有什么文章。</p>\n<p>可是，他是谁，昨天刚卖掉60只羊正要前往金字塔追寻宝藏的人，要让他们知道什么叫人不可貌相。这时，’同乡’开口问，你有多少钱让你觉得您能去’金字塔’？</p>\n<p>看吧，连他也看不起我。亚历山大随后打开他的小包，露出了他的财富。周围一阵哗然，’同乡’眼睛里闪过一阵光，激动地对亚历山大说到，“有这些钱，明天就能到金字塔”。</p>\n<p>看吧，果然，这有什么难的。亚历山大心想。”所以你能帮我吗”他问’同乡’。</p>\n<p>酒吧老板这时突然情绪激动起来，说些什么但是他听不懂。</p>\n<p>‘同乡’赶紧插话到，”他想骗你的钱，这里说话不方便，走我们快出去说。”亚历山大也突然察觉到周围人贪婪的目光纷纷向他，接着人群开始起哄。亚历山大只好捂着小包，跟随同乡一起逃离这危险境地。</p>\n<p>亚历山大跟着’同乡’跑出混乱的酒吧，两然边走边谈，’同乡’说到”我们需要两匹骆驼，各种干粮，水，帐篷…”亚历山大感到很可靠，他乡遇故知的感觉真好。他看着’同乡’侃侃而谈的样子，心想着交给这个新认识的朋友就好了，他是真心的他能帮我办妥一切，我的旅途可真顺利。压力山大将需要的资金都交给同伴去打点。</p>\n<p>“他想的还真周到”一趟金字塔之行居然要这么多钱…</p>\n<p>这时，一把宝剑吸引住亚历山大的目光，他被宝剑的华贵装饰和把手上的宝石在夕阳下璀璨的辉光深深钩住“等我找到我的宝藏，我一定要回来把它买下。”</p>\n<p>不知过了多久，亚历山大才从幻想中脱离出来，他想起来’同伴’，却发现看不到他的踪影，他开始环顾四周，想要呼喊却才意识到还不知道他’同乡’的名字。他的心里升起一阵冷寒，接着他猛地摇了摇头抱住双肩对自己说这不过是’同伴走丢了‘。他继续搜寻’同乡’的身影，别扭地呼喊其外貌特征穿着。</p>\n<p>人流如此嘈杂，周围人异样的目光让他感到刺痛，越来越痛，痛的他冒出了冷汗，他意识到他真的被骗了。即便如此，他低声嘟囔着，也许‘同乡’就会带着骆驼，水和食物还有帐篷出现在眼前，再等等吧，也许一会儿，也许太阳落山之前，也许…</p>\n<p>他的声音越来越低，直到他自己都听不见自己在说什么。夕阳倾斜，街上的人流也逐渐稀疏。</p>\n<p>亚历山大感到后悔，他打开小包，想看看里面是否还有一两枚钱，或者还没吃的三明治——里面只有老者给的两颗石头。</p>\n<p>一想到早上自己都还是腰缠万贯，仅仅是太阳西下自己就一无所有了。这种落差让他感到好不真实，他这才想起，也许酒吧的老板早就知道了，是在告诫他不要听信那’同乡’的谗言，以及酒馆的其他人都是一样的义愤填膺。但是他心高气傲，只看得到自己想看的。</p>\n","isPage":false,"isDraft":false,"permalink":"http://example.com/2026/01/04/%E5%A4%96%E6%96%87%E5%8E%9F%E6%96%87%E5%B0%8F%E8%AF%B4%E8%AF%8D%E5%8F%A5%E6%95%B4%E7%90%86/"},{"title":"java IO","content":"","isPage":false,"isDraft":false,"permalink":"http://example.com/2026/01/09/java-IO/"},{"title":"","content":"<h2 id=\"和妈妈的晚间散步-10-January-2026\"><a href=\"#和妈妈的晚间散步-10-January-2026\" class=\"headerlink\" title=\"和妈妈的晚间散步 10 January 2026\"></a>和妈妈的晚间散步 10 January 2026</h2><h3 id=\"父亲的优缺点\"><a href=\"#父亲的优缺点\" class=\"headerlink\" title=\"父亲的优缺点\"></a>父亲的优缺点</h3><blockquote>\n<p>妈妈和我说，父亲性格单纯，心直口快。常常是一个热心肠的人，看到有人需要帮助他不会放任不管，遇到不公的对待也敢于直说。因此很多人喜欢跟他交往，跟着他混由他出头；很多工厂老板喜欢他的性格，哄好他常常能笼络&#x2F;忽悠群众，愿意同他沟通。<br>可是更多是枪打出头鸟，工人们对制度的不公以他为出口，当他也觉得如此时就会不考虑三七二十一直接向老板说，听得进去的老板自然会对他有所赏识，但是人毕竟都是自私的，现实情况是老板对他的莽撞表现出不满，进而矛盾激化，他最后只能落得个遭辞退的下场。即便从那次之后制度有了缓和，待遇变得好了那也与他再无关，工人们也不会感谢他的勇气。而他呢，只能另找下家。</p>\n<p>同时他也懒，不愿意做复杂和吃苦的事情。妈妈说，他们最开始来到这个城市的时候，其实进的第一个厂是很好的，但是我父亲嫌工序复杂，不如外面简单、质检不严格的工作轻松，所以即便第一个厂他们当时是待到最后的工人，厂长还亲自挽留他们，我父亲也还是带着妈妈跑路了。妈妈说那间工厂现在的福利待遇很好，之前在里面坚持下来的同事收入都很可观，反观他们现在，工作及其不稳定，经常需要更换工厂，哪儿有活、简单活就去，没活就玩儿，一年下来上班时间实际上没有几个月。</p>\n<p>他好打牌，只要闲下来他想到的第一件事一定就是去棋牌室，这种逻辑在他身上已经像膝跳反射一样自然。</p>\n</blockquote>\n<h3 id=\"奶奶对别人家庭的羡慕\"><a href=\"#奶奶对别人家庭的羡慕\" class=\"headerlink\" title=\"奶奶对别人家庭的羡慕\"></a>奶奶对别人家庭的羡慕</h3><blockquote>\n<p>奶奶看到别人家又装修好了厨房，院子修的多么多么漂亮。就会跟家里人说，那谁家整的多么多么好，你们要攒点钱一定要先把厨房装修好。可我想说，何必处处与他人攀比，看到别人家有多好，送上一句祝福便是何必转而内耗自己，压力家人。</p>\n</blockquote>\n<h3 id=\"我的计划和打算\"><a href=\"#我的计划和打算\" class=\"headerlink\" title=\"我的计划和打算\"></a>我的计划和打算</h3><h3 id=\"感慨\"><a href=\"#感慨\" class=\"headerlink\" title=\"感慨\"></a>感慨</h3>","isPage":false,"isDraft":false,"permalink":"http://example.com/2026/01/11/%E5%9B%9E%E5%BF%86%E8%81%8A%E5%A4%A9/"}]